hospital/frontend/controllers/ConsultasController.php

    public function actionIndex()
    {
        $utenteId =  Yii::$app->user->id;
        $consulta = Consultas::find();
        $consultas = $consulta->where(["id_utente" =>$utenteId])->all();
        $utente = Profile::find()->where(['id'=> $utenteId])->one();
---
SELECT * FROM `consultas` WHERE `id_utente`=43
SELECT * FROM `profile` WHERE `id`=43