hospital/frontend/controllers/HorarioController.php

SELECT * FROM `horario`
SELECT * FROM `profile` WHERE `id` IN ('32', '33', '39', '46', '49', '50', '51', '52', '53', '54', '55', '57', '58', '59', '60', '61', '62', '64')
SELECT * FROM `profile` WHERE `id`=76
SELECT * FROM `consultas` WHERE `id_utente`=76
---
    public function actionIndex()
    {
        $ids= null;
        $utenteId =  Yii::$app->user->id;
        $horarios = Horario::find()->all();
        $utente = Profile::find();
        $medico = $utente->where(['id' => User::isMedico()])->all();
        $listMedicos = [];
        $utente = $utente->where(['id'=> $utenteId])->one();
        $ids= null;
        $idutilizador = Yii::$app->user->getId();
        $consultas = Consultas::find()->where(["id_utente"=>$idutilizador])->all();