hospital/frontend/controllers/MarcacaoController.php

SELECT EXISTS(SELECT * FROM `user` WHERE `user`.`id`='14')
---
    public function actionCreate()
    {
        $model = new Marcacao();

        //VarDumper::dump(Yii::$app->user->can('createMarcacao'));

        if (Yii::$app->user->can('createMarcacao')){

            $user = Profile::find();
            $medicoId = User::isMedico();
            $medico = $user->where(['id' => $medicoId])->all();