hospital/frontend/controllers/MarcacaoController.php

SELECT * FROM `profile` WHERE `id`='1'
SELECT `id_medico` FROM `medico_especialidade` WHERE `id_especialidade`='2'
---
    public function actionLists($id){
        $espeuser = MedicoEspecialidade::find()->where(['id_especialidade' => $id])->select('id_medico')->column();
        $profile = Profile::find()
                ->where(['id' => $espeuser])
                ->all();

SELECT * FROM `horario` WHERE `id_medico`='61'
---
    public function actionListdate($id){
        $horario = Horario::find()->where(['id_medico' => $id])->all();

SELECT * FROM `profile` WHERE `id` IN ('32', '33', '39', '46', '49', '50', '51', '52', '53', '54', '55', '57', '58', '59', '60', '61', '62', '64')
SELECT * FROM `especialidade`
SELECT * FROM `profile` WHERE `id`=75
SELECT * FROM `horario` WHERE `id`='3'
UPDATE `horario` SET `usado`=1 WHERE `id`=3
SELECT * FROM `marcacao` WHERE `id_Utente`=75
---
    public function actionCreate()
    {
        $model = new Marcacao();

        //VarDumper::dump(Yii::$app->user->can('createMarcacao'));

        if (Yii::$app->user->can('createMarcacao')){
            $idUtilizador =  Yii::$app->user->id;
            $user = Profile::find();
            $medicoId = User::isMedico();
            $medico = $user->where(['id' => $medicoId])->all();
            $esp = Especialidade::find()->all();
            $userl = Profile::find()->where(["id" => $idUtilizador])->one();
            $listEsp = [];
            $listmed = [];

            foreach ($esp as $item) {
                $listEsp[$item->id] = $item->Name;
            }

            foreach ($medico as $item) {
                $listmed[$item->id] = $item->First_name;
            }

            if ($model->load(Yii::$app->request->post())) {
                $model->id_Utente = Yii::$app->user->id;
                $horario = Horario::find()->where(["id" => $model->id])->one();
                if ($horario->usado == 0)
                {
                    $horario->usado = 1;
                    $horario->save(false);
                    $model->save(false);

                    $marcacao = Marcacao::find();
                    $marcacaoutente = $marcacao->where(['id_Utente' => $idUtilizador])->all();