hospital/frontend/controllers/SiteController.php

SELECT * FROM `profile` WHERE `id` IN ('2', '6', '7')
---
    public function actionCreate()
    {
        $model = new Marcacao();
        $utenteId = Yii::$app->user->id;
        $user = Profile::find();