hospital/common/models/User.php

SELECT * FROM `user` WHERE (`email`='tome.nunes902@gmail.com') AND (`status`=10)
---
    public static function findByEmail($email)
    {
        return static::findOne(['email' => $email, 'status' => self::STATUS_ACTIVE]);