hospital/backend/controllers/AdminController.php

SELECT COUNT(*) FROM `marcacao`
SELECT * FROM `marcacao` ORDER BY `id` LIMIT 10
---
    public function actionLista_marcacao()
    {
        $query = Marcacao::find();


        $pagination = new Pagination([
            'defaultPageSize' => 10,
            'totalCount' => $query->count()
        ]);

        $marcacoes = $query->orderBy('id')
            ->offset($pagination->offset)
            ->limit($pagination->limit)
            ->all();

SELECT * FROM `marcacao` WHERE `id`='5'
---
    public function actionNAceitar($id)
    {
        $marcacao = Marcacao::find()->where(["id" => $id])->one();

SELECT * FROM `horario` WHERE `id_medico`=45
SELECT * FROM `horario` WHERE `id`='5'
---
public function actionUpdatemarcacao($id)
{
    $model = Marcacao::find()->where(["id"=>$id])->one();
    $horario1 = Horario::find()->where(["id_medico"=>$model->id_Medico])->all();
    $horario = Horario::find()->where(["id"=>$id])->one();