hospital/backend/controllers/ContactoController.php

    public function actionRespondido($id)
    {

        $Contacto = Contacto::find()->where(["id" => $id])->one();
---
SELECT * FROM `contacto` WHERE `id`='3'