hospital/backend/controllers/DiagnosticoController.php

    public function actionIndex()
    {
        $idUtilidor = Yii::$app->user->id;
        $diagnostico = Diagnostico::find()->where(["id_medico" => $idUtilidor])->all();
---
SELECT * FROM `diagnostico` WHERE `id_medico`=45