hospital/backend/controllers/MedicamentoController.php

    public function actionIndex()
    {
        $model = Medicamento::find()->all();
---
SELECT * FROM `medicamento`