hospital/backend/controllers/SiteController.php

    public function actionTable()

        {
            $query = Profile::find()->where(['is_medico' => 0]);


            $pagination = new Pagination([
                'defaultPageSize' => 10,
                'totalCount' => $query->count()
            ]);

            $utentes = $query->orderBy('First_name')
                ->offset($pagination->offset)
                ->limit($pagination->limit)
                ->all();
---
SELECT COUNT(*) FROM `profile` WHERE `id` IN ('31', '36', '40', '42', '43')
SELECT * FROM `profile` WHERE `id` IN ('31', '36', '40', '42', '43') ORDER BY `First_name` LIMIT 10

        public function actionTable_marcacoes(){
            $id= Yii::$app->user->getId();
            $query = Marcacao::find()->where("id_Medico = ". $id);


            $pagination = new Pagination([
                'defaultPageSize' => 10,
                'totalCount' => $query->count()
            ]);

            $marcacoes = $query->orderBy('id')
                ->offset($pagination->offset)
                ->limit($pagination->limit)
                ->all();
---
SELECT COUNT(*) FROM `marcacao` WHERE id_Medico = 64
SELECT * FROM `marcacao` WHERE id_Medico = 64 ORDER BY `id` LIMIT 10